In [1]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np
# data = pd.read_csv('MA&KD CU Test.csv',index_col='datetime',parse_dates=True,header=0)
# data[:2]

In [5]:
data.columns = [header.strip() for header in data.columns]

In [6]:
data['diff'] = data.margin + data.cash - data.portfolio_value

In [7]:
data['2012-09-01':'2012-09-30'].to_csv('diff.csv')

In [ ]:
data['margin_rate'] = data.margin/data.

In [21]:
data = DataFrame([1,np.nan,2,np.nan,np.nan,3])

In [24]:
data

     0
0  1.0
1  NaN
2  2.0
3  NaN
4  NaN
5  3.0

In [25]:
data.drop_duplicates(keep='first')

     0
0  1.0
1  NaN
2  2.0
5  3.0

In [76]:
df = DataFrame(columns=['A','B','C','cal_method','description'])

In [78]:
df.loc[len(df)] = ('RC1','RC2','','A*B','desc')

In [83]:
df

     A    B C cal_method description
0  RC1  RC2          A*B        desc
1  RC1  RC2          A*B        desc

In [86]:
df = df.drop(0)

In [93]:
df = df.reset_index(drop=True)

In [94]:
df

     A    B C cal_method description
0  RC1  RC2          A*B        desc

In [96]:
a = None
if a:
    print('aaa')

In [98]:
np.log(9)

2.1972245773362196